<a href="https://colab.research.google.com/github/adudars/PedidON/blob/master/arquivos/9.4_ConsultasOperadoresLikeIlike%26Datas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 9.4 CONSULTAS QUE USAM OPERADORES LIKE E DATAS

## ESTABELECENDO CONEXÃO

### Instalando bibliotecas de acesso

In [1]:
#!pip install --user psycopg2-binary
#!pip install --user pandas

### Importando bibliotecas

In [3]:
import pandas as pd
import psycopg2

### Conectando com o banco através do psycopg2

In [4]:
conn = psycopg2.connect(host="lallah.db.elephantsql.com",database="nxthbnlu", user="nxthbnlu", password="buyAYKsY17pqexg1grIcJaWm0gHBsO2F")

## CONSULTAS QUE USAM OPERADORES LIKE/ILIKE

### Clientes que possuem a letra 'a' como a segunda letra do nome e um total de 4 letras

In [5]:
clientes_a___ = pd.read_sql_query("""select nome_cliente
                                    from cliente
                                    where nome_cliente like '_a__';""", conn)

In [6]:
clientes_a___

  nome_cliente
0         Lara
1         Davi
2         Tais

### Clientes que possuem a letra 'a' no nome

In [12]:
clientesA = pd.read_sql_query("""select *
                                from cliente
                                where nome_cliente ilike '%a%';""", conn)

In [13]:
clientesA

   id_cliente nome_cliente  cpf_cliente
0           1         Lara        10582
1           3        Clara        12890
2           4         Davi        14045
3           6        Luiza        18662
4           7          Ana        16354
5           8         Tais        17508
6           9     Isabella        19817

### Funcionários que possuem a letra 'o' como última letra do nome

In [16]:
funcionarioO = pd.read_sql_query("""select nome_funcionario
                                from funcionario
                                where nome_funcionario ilike '%O';""", conn)

In [17]:
funcionarioO

  nome_funcionario
0         Bernardo

### Dados de item de cardapio que possuem a letra 'b' como primeira letra do nome

In [18]:
itemB = pd.read_sql_query("""select *
                            from item_cardapio
                            where nome_item like 'B%';""", conn)

In [19]:
itemB

   id_itemcardapio              nome_item  ...  fk_id_categoria fk_id_tamanho
0                6  Bons ventos te trazem  ...                2             2
1                7             Barlavento  ...                2             2

[2 rows x 6 columns]

### Dados de item de cardapio que possuem um total de 10 letras no nome

In [20]:
item10 = pd.read_sql_query("""select *
                              from item_cardapio
                              where nome_item ilike '__________';""", conn)

In [21]:
item10

   id_itemcardapio   nome_item  ...  fk_id_categoria fk_id_tamanho
0                7  Barlavento  ...                2             2
1               10  Cidade Sol  ...                2             2

[2 rows x 6 columns]

## CONSULTAS QUE USAM DATAS

### Quantidade de atendimentos por mesa em datas menores ou iguais a data corrente

In [38]:
atendimentos_mesa = pd.read_sql_query("""select mesa, count(mesa) as vezes_usada_para_atendimento
                              from comanda
                              where data <= current_date
                              group by mesa
                              order by vezes_usada_para_atendimento desc;""", conn)

In [39]:
atendimentos_mesa

   mesa  vezes_usada_para_atendimento
0    13                             4
1    12                             3
2     4                             2
3     1                             2
4     3                             1
5     2                             1

### Datas dos pedidos realizados, data corrente e quantidade de dias entre as datas

In [40]:
data_pedidos = pd.read_sql_query("""select data as data_pedidos, current_date as data_de_hoje, age(current_date,data) as dias_corridos_ate_hoje
                                    from comanda
                                    group by data_pedidos
                                    order by data_pedidos asc;""", conn)

In [41]:
data_pedidos

  data_pedidos data_de_hoje dias_corridos_ate_hoje
0   2020-07-30   2020-09-12                43 days
1   2020-07-31   2020-09-12                42 days
2   2020-08-01   2020-09-12                41 days

### Núrmero referente ao mês da data dos pedidos realizados

In [44]:
mes_pedido = pd.read_sql_query("""select data as data_pedidos, date_part('month',data) as mes
                                  from comanda
                                  group by data_pedidos;""", conn)

In [45]:
mes_pedido

  data_pedidos  mes
0   2020-08-01  8.0
1   2020-07-30  7.0
2   2020-07-31  7.0

### Comandas com datas finitas

In [46]:
data_finita = pd.read_sql_query("""select isfinite(data) as datas_finita
                              from comanda
                              group by datas_finita;""", conn)

In [47]:
data_finita

   datas_finita
0          True

### Ano referente às comandas

In [49]:
data_ano = pd.read_sql_query("""select data as data_pedidos, extract('year' from data) as ano
                                from comanda
                                group by data_pedidos;""", conn)

In [50]:
data_ano

  data_pedidos     ano
0   2020-08-01  2020.0
1   2020-07-30  2020.0
2   2020-07-31  2020.0

### Data e hora dos pedidos realizados

In [53]:
data_hora = pd.read_sql_query("""select nome_cliente, concat(data, ' ' ,hora) as data_hora_pedido
                            from comanda as c
                            inner join pedido as p on
                            (p.fk_id_comanda = c.id_comanda)
                            inner join cliente as cl on
                            (cl.id_cliente = c.fk_id_cliente)
                            order by data_hora_pedido asc;""", conn)

In [54]:
data_hora

   nome_cliente     data_hora_pedido
0          Davi  2020-07-30 12:23:00
1         Jorge  2020-07-30 12:34:00
2          Davi  2020-07-30 12:37:00
3         Clara  2020-07-30 12:45:00
4         Clara  2020-07-30 12:45:00
5          Lara  2020-07-30 12:58:00
6          Lara  2020-07-30 13:19:00
7         Clara  2020-07-30 13:30:00
8        Milton  2020-07-30 13:42:00
9         Luiza  2020-07-31 12:21:00
10        Jorge  2020-07-31 12:26:00
11        Jorge  2020-07-31 12:57:00
12         Tais  2020-07-31 13:02:00
13          Ana  2020-07-31 13:15:00
14          Ana  2020-07-31 13:38:00
15        Jorge  2020-08-01 12:18:00
16     Isabella  2020-08-01 12:43:00
17         Davi  2020-08-01 13:04:00
18     Isabella  2020-08-01 13:09:00
19         Davi  2020-08-01 13:37:00
20     Henrique  2020-08-01 13:38:00
21         Davi  2020-08-01 13:49:00
22     Henrique  2020-08-01 13:51:00
23     Henrique  2020-08-01 14:23:00
24     Henrique  2020-08-01 14:29:00

### Data e hora dos pedidos realizados menores ou iguais a data e hora corrente

In [56]:
data_hora_corrente = pd.read_sql_query("""select data as data_pedido, hora
                                  from comanda as c
                                  inner join pedido as p on
                                  (p.fk_id_comanda = c.id_comanda)
                                  where hora <= current_time and data <= current_date;""", conn)

In [57]:
data_hora_corrente

   data_pedido      hora
0   2020-07-30  12:58:00
1   2020-07-30  13:19:00
2   2020-07-30  12:34:00
3   2020-07-30  12:45:00
4   2020-07-30  12:45:00
5   2020-07-30  13:30:00
6   2020-07-30  12:23:00
7   2020-07-30  12:37:00
8   2020-07-30  13:42:00
9   2020-07-31  12:26:00
10  2020-07-31  12:57:00
11  2020-07-31  12:21:00
12  2020-07-31  13:15:00
13  2020-07-31  13:38:00
14  2020-07-31  13:02:00
15  2020-08-01  13:04:00
16  2020-08-01  13:37:00
17  2020-08-01  13:49:00
18  2020-08-01  12:18:00
19  2020-08-01  12:43:00
20  2020-08-01  13:09:00
21  2020-08-01  13:38:00
22  2020-08-01  13:51:00
23  2020-08-01  14:23:00
24  2020-08-01  14:29:00